Repository: josermartinez/electric_cars
Catalog: packages/common/lib/res/l10n/app_*.arb
Languages: es

# main_app_bar_title
source: Electric cars
es: Vehículos electricos

# on_boarding_welcome_title
source: Welcome
es: Bienvenido

# on_boarding_welcome_message
source: Welcome to Electric cars, your go-to destination for electric vehicles and stations information. We're thrilled to have you on board and can't wait for you to start exploring all the amazing features our app has to offer.
es: Bienvenido a Electric cars, su destino de referencia para vehículos eléctricos e información de estaciones. Estamos encantados de tenerte a bordo y no podemos esperar a que comiences a explorar todas las increíbles funciones que nuestra aplicación tiene para ofrecer.

# on_boarding_button_label
source: Continue
es: Continuar

# on_boarding_ask_permission_title
source: Permissions needed
es: Permisos requeridos

# on_boarding_ask_permission_message
source: Hi there! To provide you with the best experience possible, Electric cars needs your permission to access your device's location. We promise to use this information solely to improve your experience within the app.
es: ¡Hola! Para brindarle la mejor experiencia posible, Electric cars necesita su permiso para acceder a la ubicación de su dispositivo. Prometemos utilizar esta información únicamente para mejorar su experiencia dentro de la aplicación.

# on_boarding_permission_success_title
source: Awesome
es: Genial

# on_boarding_permission_success_message
source: Great news! You've just granted Electric cars permission to access your device's location. Thank you for trusting us with this information. This will help us to provide you with the best experience possible.
es: ¡Una gran noticia! Acabas de conceder permiso a Electric cars para acceder a la ubicación de tu dispositivo. Gracias por confiarnos esta información. Esto nos ayudará a brindarle la mejor experiencia posible.

# on_boarding_permission_denied_title
source: Sorry
es: Lo sentimos

# on_boarding_permission_denied_message
source: We're sorry, but Electric cars needs your device's location to provide you with the best experience possible. Unfortunately, you've chosen not to grant us access to your location data. Without access to your location, we will be unable to continue.
es: Lo sentimos, pero Electric cars necesita la ubicación de su dispositivo para brindarle la mejor experiencia posible. Desafortunadamente, ha elegido no otorgarnos acceso a sus datos de ubicación. Sin acceso a su ubicación, no podremos continuar.

# on_boarding_thank_you_title
source: Congratulations
es: Felicitaciones

# on_boarding_thank_you_message
source: You've completed the setup process for Electric cars and are now ready to start using all its features
es: Has completado el proceso de configuración de los coches eléctricos y ahora estás listo para empezar a utilizar todas sus funciones.

# on_boarding_thank_you_button_label
source: Let's start driving
es: Empecemos a conducir

# vehicle_details_bar_title
source: Vehicle details
es: Detalles del vehículo

# main_bottom_nav_option_electric_cars
source: Electric cars
es: Vehículos eléctricos

# main_bottom_nav_option_stations
source: Stations
es: Estaciones

# vehicle_detail_range_property_label
source: Chargetrip real rangeâ„¢
es: Alcance real de Chargetrip™

# vehicle_detail_battery_property_label
source: Usable battery
es: Batería usable

# vehicle_detail_charging_support_property_label
source: Fast charging support
es: Soporte de carga rápida

# vehicle_detail_performance_section_title
source: Performance
es: Rendimiento

# vehicle_detail_speed_property_label
source: Top speed
es: Maxima velocidad

# vehicle_detail_acceleration_property_label
source: Acceleration
es: Aceleración

# station_details_bar_title
source: Station Details
es: Detalles de la estación

# station_detail_name_property_label
source: Name
es: Nombre

# station_detail_address_property_label
source: Address
es: Dirección

# station_detail_rating_property_label
source: Rating
es: Clasificación
